src/InformationRegisters/ОчередьSQL/ОчередьSQL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьSQL</name>
  <resources>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>TID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>UID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ОчередьSQL/Module.bsl
Процедура ДобавитьВОчередь(ТекстЗапроса) Экспорт
	
	Если НЕ Константы.РаботаСОчередьюSQLРазрешена.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКомпьютера = "";
	ИмяПользователя = "";
	НомерСеанса = НомерСеансаИнформационнойБазы();
	
	Для Каждого СеансИБ Из ПолучитьСеансыИнформационнойБазы() Цикл
		Если СеансИБ.НомерСеанса = НомерСеанса Тогда
			ИмяКомпьютера = СеансИБ.ИмяКомпьютера;
			ИмяПользователя = СеансИБ.Пользователь.ПолноеИмя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Запись = РегистрыСведений.ОчередьSQL.СоздатьМенеджерЗаписи();
	Запись.TID = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Запись.UID = Новый УникальныйИдентификатор();
	Запись.ТекстЗапроса = ТекстЗапроса;
	Запись.ИмяПользователя = ИмяПользователя;
	Запись.ИмяКомпьютера = ИмяКомпьютера;
	Запись.Записать(Ложь);
	
КонецПроцедуры

Процедура УдалитьИзОчереди(TID, UID) Экспорт
	
	Запись = РегистрыСведений.ОчередьSQL.СоздатьМенеджерЗаписи();
	Запись.TID = TID;
	Запись.UID = UID;
	Запись.Удалить();
	
КонецПроцедуры

Функция ПолучитьПервыйИзОчереди() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОчередьSQL.ТекстЗапроса КАК ТекстЗапроса,
	|	ОчередьSQL.TID КАК TID
	|ИЗ
	|	РегистрСведений.ОчередьSQL КАК ОчередьSQL
	|
	|УПОРЯДОЧИТЬ ПО
	|	TID");
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Новый Структура("TID, ТекстЗапроса", Выборка.TID, Выборка.ТекстЗапроса);
	КонецЕсли;
	
КонецФункции


Процедура ВыполнитьВсеЗапросыИзОчереди() Экспорт
	
	Возврат;
	
	Если Константы.РаботаСОчередьюSQLРазрешена.Получить() Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ОчередьSQL.ТекстЗапроса КАК ТекстЗапроса,
		|	ОчередьSQL.TID КАК TID,
		|	ОчередьSQL.UID КАК UID,
		|	ОчередьSQL.ИмяПользователя КАК ИмяПользователя,
		|	ОчередьSQL.ИмяКомпьютера КАК ИмяКомпьютера
		|ИЗ
		|	РегистрСведений.ОчередьSQL КАК ОчередьSQL
		|
		|УПОРЯДОЧИТЬ ПО
		|	TID");
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			
			СоединениеАДО = ЗапросыЧерезАДО.ПолучитьСоединениеАДО("Fin_Request");
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ТекстЗапроса = СокрЛП(Выборка.ТекстЗапроса);
				
				Если НЕ ЗначениеЗаполнено(СокрЛП(Выборка.ИмяПользователя)) Тогда
					РезультатВыполнения = ЗапросыЧерезАДО.ВыполнитьЗапрос(СоединениеАДО, ТекстЗапроса);
				Иначе
					ТекстЗапроса = ТекстЗапроса + ", '" + СокрЛП(Выборка.ИмяПользователя) + "', '" + СокрЛП(Выборка.ИмяКомпьютера) + "'";
					РезультатВыполнения = ЗапросыЧерезАДО.ВыполнитьЗапрос(СоединениеАДО, ТекстЗапроса);
				КонецЕсли;
				
				Если РезультатВыполнения Тогда
					УдалитьИзОчереди(Выборка.TID, Выборка.UID);
				Иначе
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			ЗапросыЧерезАДО.ЗакрытьСоединениеАДО(СоединениеАДО);
			
		КонецЕсли;
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ РегистрСведений.ОчередьSQL");
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			
			Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОчередьSQL);
			Задание.Использование = Ложь;
			Задание.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
